`timescale 1ns / 1ps



module tb_fourbit_full_adder ();


    reg cin, a0, a1, a2, a3, b0, b1, b2, b3;
    wire sum0, sum1, sum2, sum3, c;

    fourbit_full_adder dut (
        .a0(a0),
        .a1(a1),
        .a2(a2),
        .a3(a3),
        .b0(b0),
        .b1(b1),
        .b2(b2),
        .b3(b3),
        .cin(cin),
        .sum0(sum0),
        .sum1(sum1),
        .sum2(sum2),
        .sum3(sum3),
        .c(c)
    );

    initial begin

        #0;
        a0 = 0;
        b0 = 0;
        a1 = 0;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;///10

        a0 = 1;
        b0 = 0;
        a1 = 0;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;///20
        
        a0 = 0;
        b0 = 1;
        a1 = 0;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;///30

        a0 = 1;
        b0 = 1;
        a1 = 0;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;///40
//00000000000000000000

        a0 = 0;
        b0 = 0;
        a1 = 1;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;//50

        a0 = 1;
        b0 = 0;
        a1 = 1;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;//60

        a0 = 0;
        b0 = 1;
        a1 = 1;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;//70

        a0 = 1;
        b0 = 1;
        a1 = 1;
        b1 = 0;
        a2 = 0;
        b2 = 0;
        a3 = 0;
        b3 = 0;
        cin = 0;
        #10;//80

//a1=11111111111111111111

        a0 = 0;
        b0 = 0;
        a1 = 1;
        b1 = 1;
        a2 = 1;
        b2 = 1;
        a3 = 1;
        b3 = 1;
        cin = 0;
        #10;//90

        a0 = 1;
        b0 = 0;
        a1 = 1;
        b1 = 1;
        a2 = 1;
        b2 = 1;
        a3 = 1;
        b3 = 1;
        cin = 0;
        #10;//100

        a0 = 0;
        b0 = 1;
        a1 = 1;
        b1 = 1;
        a2 = 1;
        b2 = 1;
        a3 = 1;
        b3 = 1;
        cin = 0;
        #10;//110

        a0 = 1;
        b0 = 1;
        a1 = 1;
        b1 = 1;
        a2 = 1;
        b2 = 1;
        a3 = 1;
        b3 = 1;
        cin = 0;
        #10//120
        $stop;
        ///////모두 1이고 a0와 b0만 변할 때
    end


endmodule
